In [1]:
import pandas as pd
import numpy as np

In [2]:
#read the files
titanicTrain=pd.read_csv("C:/Users/kallol/Desktop/Kaggle/Titanic/train.csv")
titanicTest=pd.read_csv("C:/Users/kallol/Desktop/Kaggle/Titanic/test.csv")

In [3]:
#display first five row of train data
titanicTrain.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#display first five row of the test data
titanicTest.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
#find total no. of records in train data
titanicTrain.PassengerId.count()

891

In [6]:
#removing unwanted columns from the dataframe
#name, passanger id, cabin doesn't make any sense for prediction
#Same goes for embarked
titanicTrain=titanicTrain.drop('Ticket',1)
titanicTrain=titanicTrain.drop('Fare',1)
titanicTrain=titanicTrain.drop('Cabin',1)
titanicTrain=titanicTrain.drop('PassengerId',1)
titanicTrain=titanicTrain.drop('Embarked',1)
titanicTrain=titanicTrain.drop('Name',1)

In [7]:
#Same thing will be done for test data as well
titanicTest=titanicTest.drop('Ticket',1)
titanicTest=titanicTest.drop('Fare',1)
titanicTest=titanicTest.drop('Cabin',1)
titanicTest=titanicTest.drop('PassengerId',1)
titanicTest=titanicTest.drop('Embarked',1)
titanicTest=titanicTest.drop('Name',1)

In [8]:
#now check for train data
titanicTrain.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [9]:
#test data
titanicTest.head()

   Pclass     Sex   Age  SibSp  Parch
0       3    male  34.5      0      0
1       3  female  47.0      1      0
2       2    male  62.0      0      0
3       3    male  27.0      0      0
4       3  female  22.0      1      1

In [10]:
#now we found that ticket is also not required
#let's remove tickets as well
#titanicTrain=titanicTrain.drop('Ticket',1)
#titanicTest=titanicTest.drop('Ticket',1)

In [11]:
#now we found that there are two categories in sex(e.g. male and female) We can create another category as child based on age.
#so first let's check if any null value present in age and sex column
print sum(titanicTrain.Sex.isnull())
print sum(titanicTrain.Age.isnull())

0
177

In [12]:
#we found 177 null values for age column should we replace those with some value or can we go for removing those columns
#lets check if the data is imbalanced
from collections import Counter
Counter(titanicTrain.Survived)

Counter({0: 549, 1: 342})

In [13]:
#lets check the same for those 177 rows
nullRaw=pd.read_csv("C:/Users/kallol/Desktop/Kaggle/Titanic/train.csv")
nullData=nullRaw[(nullRaw.Age.isnull())]

In [14]:
#Lets check
Counter(nullData.Survived)

Counter({0: 125, 1: 52})

In [15]:
#check for null data head
nullData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [16]:
#create another dataframe where age is not null
notNullData=nullRaw[(nullRaw.Age.notnull())]

In [17]:
#check the head for notNullData
notNullData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
#now I will apply random forest methode to replace missing age values
#so we need to remove unwanted columns
notNullData=notNullData.drop('Survived',1)
notNullData=notNullData.drop('PassengerId',1)
notNullData=notNullData.drop('Name',1)
notNullData=notNullData.drop('Ticket',1)
notNullData=notNullData.drop('Cabin',1)

In [19]:
#calling sklearn library to apply random forest
from sklearn.ensemble import RandomForestRegressor

In [20]:
#importing necessary files
from sklearn.model_selection import train_test_split

In [21]:
modelRF=RandomForestRegressor()

In [22]:
notNullData.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [23]:
notNullData.iloc[:,[0,1,3,4,5,6]].head()

   Pclass     Sex  SibSp  Parch     Fare Embarked
0       3    male      1      0   7.2500        S
1       1  female      1      0  71.2833        C
2       3  female      0      0   7.9250        S
3       1  female      1      0  53.1000        S
4       3    male      0      0   8.0500        S

In [24]:
#converting into dummies for sex and Embarked
notNullData.Sex=pd.get_dummies(notNullData.Sex)
notNullData.Embarked=pd.get_dummies(notNullData.Embarked)

In [25]:
#passing parameters in random forest classifier for creating the model
modelRF.fit(np.array(notNullData.iloc[:,[0,1,3,4,5,6]]),notNullData.iloc[:,2])

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
           oob_score=False, random_state=None, verbose=0, warm_start=False)

In [26]:
nullData=nullData.drop('Survived',1)
nullData=nullData.drop('PassengerId',1)
nullData=nullData.drop('Name',1)
nullData=nullData.drop('Ticket',1)
nullData=nullData.drop('Cabin',1)

In [27]:
nullData=nullData.drop('Age',1)

In [28]:
nullData.head()

    Pclass     Sex  SibSp  Parch     Fare Embarked
5        3    male      0      0   8.4583        Q
17       2    male      0      0  13.0000        S
19       3  female      0      0   7.2250        C
26       3    male      0      0   7.2250        C
28       3  female      0      0   7.8792        Q

In [29]:
#converting into dummies for sex and embarked
nullData.Embarked=pd.get_dummies(nullData.Embarked)
nullData.Sex=pd.get_dummies(nullData.Sex)

In [30]:
#check for nullData
nullData.head()

    Pclass  Sex  SibSp  Parch     Fare  Embarked
5        3    0      0      0   8.4583         0
17       2    0      0      0  13.0000         0
19       3    1      0      0   7.2250         1
26       3    0      0      0   7.2250         1
28       3    1      0      0   7.8792         0

In [31]:
#remove Survived and Age for prediction
#nullData=nullData.drop('Survived',1)
#nullData=nullData.drop('Age',1)

In [32]:
#check again
#nullData.head()

In [33]:
#storing the predicted value
p=modelRF.predict(nullData)

In [34]:
#assigning the predicted value in place of NA
nullData['Age']=p

In [35]:
#checking again
nullData.head()

    Pclass  Sex  SibSp  Parch     Fare  Embarked        Age
5        3    0      0      0   8.4583         0  22.016667
17       2    0      0      0  13.0000         0  32.564072
19       3    1      0      0   7.2250         1  16.266667
26       3    0      0      0   7.2250         1  30.250238
28       3    1      0      0   7.8792         0  23.250000

In [36]:
#check for not null data head
notNullData.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    0  22.0      1      0   7.2500         0
1       1    1  38.0      1      0  71.2833         1
2       3    1  26.0      0      0   7.9250         0
3       1    1  35.0      1      0  53.1000         0
4       3    0  35.0      0      0   8.0500         0

In [37]:
#check the titanic train
titanicTrain.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [38]:
#titanicTrain.iloc[1,3]==nullData
#pd.isnull(titanicTrain.iloc[1,3])==False
p[0]

22.016666666666666

In [39]:
x=0
for i in range(0,890):
    if(pd.isnull(titanicTrain.iloc[i,3])==True):
        titanicTrain.iloc[i,3]=p[x]
        x=x+1

In [40]:
#check for titanicData if it got replaced
sum(titanicTrain.Age.isnull())

0

In [41]:
#so it NA got replaced
#lets see titanic data again for further analysis
titanicTrain.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [42]:
#adding a new column
titanicTrain['Child']=np.nan

In [43]:
#right now we have two categories of sex, either male or female but in original titanic movie, child had a big impact.
#so we will create another class child in sex who had age less than 12 years
for i in range(0,891):
    if(titanicTrain.iloc[i,3]<=12):
        titanicTrain['Child']='child'
    else:
        titanicTrain['Child']='adult'

In [44]:
#convert Sex and Child into dummies
titanicTrain.Child=pd.get_dummies(titanicTrain.Child)
titanicTrain.Sex=pd.get_dummies(titanicTrain.Sex)

In [45]:
titanicTrain.head()

   Survived  Pclass  Sex   Age  SibSp  Parch  Child
0         0       3    0  22.0      1      0      1
1         1       1    1  38.0      1      0      1
2         1       3    1  26.0      0      0      1
3         1       1    1  35.0      1      0      1
4         0       3    0  35.0      0      0      1

In [46]:
#now we can find the family size by adding SibSp and Parch
titanicTrain['FamilySize']=np.nan
for i in range(0,891):
    titanicTrain.iloc[i,7]=titanicTrain.iloc[i,4]+titanicTrain.iloc[i,5]

In [47]:
#now delete SibSp and Parch columns
#titanicTrain=titanicTrain.drop('SibSp',1)
#titanicTrain=titanicTrain.drop('Parch',1)

In [48]:
#Final EDA
titanicTrain.head()

   Survived  Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0         0       3    0  22.0      1      0      1         1.0
1         1       1    1  38.0      1      0      1         1.0
2         1       3    1  26.0      0      0      1         0.0
3         1       1    1  35.0      1      0      1         1.0
4         0       3    0  35.0      0      0      1         0.0

In [49]:
#adding dummy variables for sex
#titanicTrain.Sex=pd.get_dummies(titanicTrain.Sex)

In [50]:
#adding libraries for cross validation
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import cross_val_predict

In [51]:
#applying train test split to measure the accuracy
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [52]:
#xtrain.head()

In [53]:
#use random forest first for prediction:
from sklearn.ensemble import RandomForestClassifier
rf=RandomForestClassifier()

In [54]:
#cross validation scores using all colums got after EDA
#rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [55]:
#applying train test split to measure the accuracy
#we are removing SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [56]:
#cross validation scores after removing sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [57]:
#applying train test split to measure the accuracy
#we are removing ParCh column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [58]:
#cross validation scores After removing Parch colums got after EDA
#rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [59]:
#applying train test split to measure the accuracy
#we are removing ParCh and SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [60]:
#cross validation scores after removing parch and sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [61]:
#we found if we remove SIBSP colums from the final EDA we got the better accuray as we dont know which columns to remove.
#So the final rf model will be build after removing sibSp column from the final EDA

In [62]:
#we need the same EDA for test data as well
#lets check the titanic test data at first
nullRaw=pd.read_csv("C:/Users/kallol/Desktop/Kaggle/Titanic/test.csv")

nullData=nullRaw[(nullRaw.Age.isnull())]
notNullData=nullRaw[(nullRaw.Age.notnull())]

notNullData=notNullData.drop('PassengerId',1)
notNullData=notNullData.drop('Name',1)
notNullData=notNullData.drop('Ticket',1)
notNullData=notNullData.drop('Cabin',1)

nullData=nullData.drop('PassengerId',1)
nullData=nullData.drop('Name',1)
nullData=nullData.drop('Ticket',1)
nullData=nullData.drop('Cabin',1)
nullData=nullData.drop('Age',1)

In [63]:
nullData.head()

    Pclass     Sex  SibSp  Parch     Fare Embarked
10       3    male      0      0   7.8958        S
22       1  female      0      0  31.6833        S
29       3    male      2      0  21.6792        C
33       3  female      1      2  23.4500        S
36       3  female      0      0   8.0500        S

In [64]:
notNullData.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [65]:
#check if there is any null value in age
print sum(titanicTest.Age.isnull())

86

In [66]:
#we have one null value in fare and 86 values in Age.
#we will apply mean value for one null fare
#we will use random forest for null age values like train data
#check how many rows are there in test data
titanicTest.Pclass.count()

418

In [67]:
notNullData.head()
sum(notNullData.Fare.isnull())

1

In [68]:
for i in range(0,notNullData.Pclass.count()):
    if(pd.isnull(notNullData.iloc[i,5])==True):
        notNullData.iloc[i,5]=notNullData.Fare.mean()

In [69]:
#creating test data where age is null
#nullTest=titanicTest[titanicTest.Age.isnull()]

In [70]:
#creating not null test data
#notNullTest=titanicTest[titanicTest.Age.notnull()]

In [71]:
#lets check for not null test data
nullData.head()

    Pclass     Sex  SibSp  Parch     Fare Embarked
10       3    male      0      0   7.8958        S
22       1  female      0      0  31.6833        S
29       3    male      2      0  21.6792        C
33       3  female      1      2  23.4500        S
36       3  female      0      0   8.0500        S

In [72]:
notNullData.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [73]:
#converting sex,embarked into dummy variables
nullData.Sex=pd.get_dummies(nullData.Sex)
nullData.Embarked=pd.get_dummies(nullData.Embarked)
notNullData.Sex=pd.get_dummies(notNullData.Sex)
notNullData.Embarked=pd.get_dummies(notNullData.Embarked)

In [74]:
#applying random forest for test
testRF=RandomForestRegressor()

In [75]:
#fitting data
modelTestRF=testRF.fit(np.array(notNullData.iloc[:,[0,1,3,4,5,6]]),notNullData.iloc[:,2])

In [76]:
#assigning the predicted value into a variable
z=modelTestRF.predict(nullData)

In [77]:
#check for the values in z
z[1]

31.800000000000001

In [78]:
titanicTest.head()

   Pclass     Sex   Age  SibSp  Parch
0       3    male  34.5      0      0
1       3  female  47.0      1      0
2       2    male  62.0      0      0
3       3    male  27.0      0      0
4       3  female  22.0      1      1

In [79]:
#assigning these falues into titanic test data set
x=0
for i in range(0,418):
    if(pd.isnull(titanicTest.iloc[i,2])==True):
        titanicTest.iloc[i,2]=z[x]
        x=x+1

In [80]:
#check for titanic test data
titanicTest.head()

   Pclass     Sex   Age  SibSp  Parch
0       3    male  34.5      0      0
1       3  female  47.0      1      0
2       2    male  62.0      0      0
3       3    male  27.0      0      0
4       3  female  22.0      1      1

In [81]:
#adding a new column
titanicTest['Child']=np.nan
#assigning the values
for i in range(0,418):
    if(titanicTest.iloc[i,2]<=12):
        titanicTest['Child']='child'
    else:
        titanicTest['Child']='adult'

In [82]:
#check if the column child is created
titanicTest.head()

   Pclass     Sex   Age  SibSp  Parch  Child
0       3    male  34.5      0      0  adult
1       3  female  47.0      1      0  adult
2       2    male  62.0      0      0  adult
3       3    male  27.0      0      0  adult
4       3  female  22.0      1      1  adult

In [83]:
#creating dummy variable for Sex and child category
titanicTest.Sex=pd.get_dummies(titanicTest.Sex)
titanicTest.Child=pd.get_dummies(titanicTest.Child)

In [84]:
#creating family size for test data
titanicTest['FamilySize']=np.nan
for i in range(0,418):
    titanicTest.iloc[i,6]=titanicTest.iloc[i,3]+titanicTest.iloc[i,4]

In [85]:
titanicTest.head()

   Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0       3    0  34.5      0      0      1         0.0
1       3    1  47.0      1      0      1         1.0
2       2    0  62.0      0      0      1         0.0
3       3    0  27.0      0      0      1         0.0
4       3    1  22.0      1      1      1         2.0

In [86]:
#applying train test split to measure the accuracy
#we are removing SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [87]:
#titanicTest.head()

In [88]:
titanicTrain.head()

   Survived  Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0         0       3    0  22.0      1      0      1         1.0
1         1       1    1  38.0      1      0      1         1.0
2         1       3    1  26.0      0      0      1         0.0
3         1       1    1  35.0      1      0      1         1.0
4         0       3    0  35.0      0      0      1         0.0

In [89]:
Counter(titanicTrain.Survived)

Counter({0: 549, 1: 342})

In [90]:
#we found that this is an imbalanced dataset, so we are balancing it by undersampling
titanicTrain1=titanicTrain[titanicTrain.Survived==1]

In [91]:
#fetching those rows having target class as zero
titanicTrain2=titanicTrain[titanicTrain.Survived==0]

In [92]:
#taking a sample of 342
titanicTrain0=titanicTrain2.sample(n=342)

In [94]:
#joining two different datasets
titanicTrain=titanicTrain1.append(titanicTrain2)

In [95]:
titanicTrain=titanicTrain.sample(frac=1).reset_index(drop=True)

In [96]:
#creating test set and train set for cross validation
xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'],test_size=0.25,random_state=123)

In [97]:
xtrain.head()

     Pclass  Sex       Age  SibSp  Child
660       3    0  26.00000      0      1
852       3    1  29.00000      1      1
703       3    0  25.00000      1      1
886       2    0  28.00000      0      1
525       3    0  34.61341      1      1

In [98]:
#now we are going to apply random forest but with some parameter tuning let's check for the accuracy 
#cross validation scores using all colums got after EDA
m=1
for i in range (0,10):
        rf=RandomForestClassifier(max_depth=m)
        rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
        print rf_cv_score.mean()
        m=m+1

0.791904720341
0.788986313213
0.817401796365
0.826334908582
0.811430815846
0.821846074556
0.81592014863
0.821912575801
0.797919259176
0.797919259176

In [99]:
#now we are going to apply random forest but with some parameter tuning let's check for the accuracy 
#cross validation scores using all colums got after EDA
m=65
for i in range (0,20):
        rf=RandomForestClassifier(max_depth=4,n_estimators=m)
        rf_cv_score=cross_val_score(estimator=rf,X=xtrain,y=xtest,cv=5)
        print rf_cv_score.mean()
        m=m+1

0.823371779365
0.826390353994
0.827871835476
0.823416501453
0.823394057283
0.829364372789
0.826379131909
0.82343877937
0.824909038766
0.820464594322
0.830890410105
0.821901353716
0.830868132188
0.826390520248
0.824897982934
0.829375594874
0.829397872791
0.824909038766
0.824897816681
0.824897816681

In [100]:
#so we found the parameters
#let's predict for the test data
rfFinalModel=RandomForestClassifier(max_depth=6,n_estimators=74)

In [101]:
#lets check the data before fitting
titanicTrain.head()

   Survived  Pclass  Sex        Age  SibSp  Parch  Child  FamilySize
0         0       2    0  25.000000      0      0      1         0.0
1         0       3    0  21.000000      0      0      1         0.0
2         1       3    1  27.837262      0      0      1         0.0
3         1       1    1  32.000000      0      0      1         0.0
4         1       2    1  21.000000      0      0      1         0.0

In [102]:
xtrain.head()

     Pclass  Sex       Age  SibSp  Child
660       3    0  26.00000      0      1
852       3    1  29.00000      1      1
703       3    0  25.00000      1      1
886       2    0  28.00000      0      1
525       3    0  34.61341      1      1

In [103]:
#we found parch and family are not required for final model, we are not putting it
rfFinalModel.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=6, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=74, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [104]:
ytrain.head()

     Pclass  Sex   Age  SibSp  Child
172       3    0  35.0      0      1
524       3    0  19.0      0      1
452       3    1  16.9      0      1
170       1    0  54.0      0      1
620       3    0  32.0      0      1

In [106]:
#x=sclf.predict(ytrain)

In [107]:
from sklearn import metrics

In [109]:
#metrics.accuracy_score(x,ytest)

In [110]:
ytrain.head()

     Pclass  Sex   Age  SibSp  Child
172       3    0  35.0      0      1
524       3    0  19.0      0      1
452       3    1  16.9      0      1
170       1    0  54.0      0      1
620       3    0  32.0      0      1

In [111]:
#model got build, now check for test data before predicting
titanicTest.head()

   Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0       3    0  34.5      0      0      1         0.0
1       3    1  47.0      1      0      1         1.0
2       2    0  62.0      0      0      1         0.0
3       3    0  27.0      0      0      1         0.0
4       3    1  22.0      1      1      1         2.0

In [112]:
#Lets predict and store it
rfModelOutput=rfFinalModel.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [113]:
Counter(rfModelOutput)
#titanicTest.Age.count()

Counter({0: 278, 1: 140})

In [114]:
#now we will use SVM for another model we will do ensambling later.
from sklearn import svm

In [115]:
modelSvm=svm.SVC()

In [116]:
#applying train test split to measure the accuracy
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [117]:
#cross validation scores using all colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [118]:
#applying train test split to measure the accuracy
#we are removing SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [119]:
#cross validation scores after removing sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [120]:
#applying train test split to measure the accuracy
#we are removing ParCh column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [121]:
#cross validation scores After removing Parch colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [122]:
#applying train test split to measure the accuracy
#we are removing ParCh and SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [123]:
#cross validation scores after removing parch and sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [124]:
#for final one
xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [125]:
#here the the train set with all the variables are giving better results
#lets tune the parameters befor creating final model 8202
m=4.5
for i in range(0,10):
    modelSvm=svm.SVC(kernel='rbf',C=m)
    svm_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
    print svm_cv_score.mean()
    m=m+0.1

0.815458064516
0.817070967742
0.818670967742
0.820283870968
0.820283870968
0.820283870968
0.820283870968
0.820283870968
0.820283870968
0.820283870968

In [126]:
#so we found if cost is 0.04 the accuracy is maximum, lets find the gamma function lets predict the output
#but lets check the train and test data first
titanicTrain.head()

   Survived  Pclass  Sex        Age  SibSp  Parch  Child  FamilySize
0         0       2    0  25.000000      0      0      1         0.0
1         0       3    0  21.000000      0      0      1         0.0
2         1       3    1  27.837262      0      0      1         0.0
3         1       1    1  32.000000      0      0      1         0.0
4         1       2    1  21.000000      0      0      1         0.0

In [127]:
titanicTest.head()

   Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0       3    0  34.5      0      0      1         0.0
1       3    1  47.0      1      0      1         1.0
2       2    0  62.0      0      0      1         0.0
3       3    0  27.0      0      0      1         0.0
4       3    1  22.0      1      1      1         2.0

In [128]:
#fit the model 0.4
modelSvm=svm.SVC(kernel='rbf',C=5)
modelSvm.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

SVC(C=5, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False)

In [129]:
#lets predict the output
svmModelOutput=modelSvm.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [130]:
Counter(svmModelOutput)

Counter({0: 280, 1: 138})

In [131]:
#gradiant boosting
from sklearn.ensemble import GradientBoostingClassifier
modelGradBoost=GradientBoostingClassifier(max_depth=4,min_samples_leaf=4)
modelGradBoost.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

GradientBoostingClassifier(criterion='friedman_mse', init=None,
              learning_rate=0.1, loss='deviance', max_depth=4,
              max_features=None, max_leaf_nodes=None,
              min_impurity_decrease=0.0, min_impurity_split=None,
              min_samples_leaf=4, min_samples_split=2,
              min_weight_fraction_leaf=0.0, n_estimators=100,
              presort='auto', random_state=None, subsample=1.0, verbose=0,
              warm_start=False)

In [132]:
m=2
for i in range(0,10):
    modelGradBoost=GradientBoostingClassifier(max_depth=4,min_samples_split=m)
    svm_cv_score=cross_val_score(estimator=modelGradBoost,X=xtrain,y=xtest,cv=5)
    print svm_cv_score.mean()
    m=m+1

0.785032258065
0.786670967742
0.791458064516
0.793070967742
0.778619354839
0.788258064516
0.789819354839
0.793058064516
0.789870967742
0.789883870968

In [133]:
modelGradBoost=GradientBoostingClassifier(max_depth=4,min_samples_split=5)

In [134]:
#cross validation scores using all colums got after EDA
rf_cv_score=cross_val_score(estimator=modelGradBoost,X=xtrain,y=xtest,cv=5)
rf_cv_score.mean()

0.79307096774193553

In [135]:
#fitting the data
modelGradBoost.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

GradientBoostingClassifier(criterion='friedman_mse', init=None,
              learning_rate=0.1, loss='deviance', max_depth=4,
              max_features=None, max_leaf_nodes=None,
              min_impurity_decrease=0.0, min_impurity_split=None,
              min_samples_leaf=1, min_samples_split=5,
              min_weight_fraction_leaf=0.0, n_estimators=100,
              presort='auto', random_state=None, subsample=1.0, verbose=0,
              warm_start=False)

In [136]:
#storing the output of gradient boosting
gradBoostOutput=modelGradBoost.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [137]:
#lets try logistic regression model
from sklearn import linear_model

In [138]:
modelLogit=linear_model.LogisticRegression(penalty='l1')

In [139]:
titanicTrain.head()

   Survived  Pclass  Sex        Age  SibSp  Parch  Child  FamilySize
0         0       2    0  25.000000      0      0      1         0.0
1         0       3    0  21.000000      0      0      1         0.0
2         1       3    1  27.837262      0      0      1         0.0
3         1       1    1  32.000000      0      0      1         0.0
4         1       2    1  21.000000      0      0      1         0.0

In [140]:
#applying train test split to measure the accuracy
xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [141]:
#cross validation scores using all colums got after EDA
rf_cv_score=cross_val_score(estimator=modelLogit,X=xtrain,y=xtest,cv=5)
rf_cv_score.mean()

0.80095483870967743

In [142]:
#applying train test split to measure the accuracy
#we are removing SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [143]:
#m=1
#for i in range(0,10):
    #modelLogit=linear_model.LogisticRegression(penalty='l1')
    #svm_cv_score=cross_val_score(estimator=modelSvm,X=xtrain,y=xtest,cv=5)
    #print svm_cv_score.mean()
    #m=m+1

In [144]:
#cross validation scores after removing sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelLogit,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [145]:
#applying train test split to measure the accuracy
#we are removing ParCh column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [146]:
#cross validation scores After removing Parch colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelLogit,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [147]:
#applying train test split to measure the accuracy
#we are removing ParCh and SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [148]:
#cross validation scores after removing parch and sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelLogit,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [149]:
titanicTrain.head()

   Survived  Pclass  Sex        Age  SibSp  Parch  Child  FamilySize
0         0       2    0  25.000000      0      0      1         0.0
1         0       3    0  21.000000      0      0      1         0.0
2         1       3    1  27.837262      0      0      1         0.0
3         1       1    1  32.000000      0      0      1         0.0
4         1       2    1  21.000000      0      0      1         0.0

In [150]:
#we need to include all columns to create logistic regression model
#fit the model
modelLogit=linear_model.LogisticRegression(penalty='l1')
modelLogit.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l1', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [151]:
titanicTest.head()

   Pclass  Sex   Age  SibSp  Parch  Child  FamilySize
0       3    0  34.5      0      0      1         0.0
1       3    1  47.0      1      0      1         1.0
2       2    0  62.0      0      0      1         0.0
3       3    0  27.0      0      0      1         0.0
4       3    1  22.0      1      1      1         2.0

In [152]:
#predict the output
logitFinalOutput=modelLogit.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [153]:
Counter(logitFinalOutput)

Counter({0: 263, 1: 155})

In [154]:
#lets try knn method
from sklearn import neighbors

In [155]:
modelKnn=neighbors.KNeighborsClassifier()

In [156]:
titanicTrain.head()

   Survived  Pclass  Sex        Age  SibSp  Parch  Child  FamilySize
0         0       2    0  25.000000      0      0      1         0.0
1         0       3    0  21.000000      0      0      1         0.0
2         1       3    1  27.837262      0      0      1         0.0
3         1       1    1  32.000000      0      0      1         0.0
4         1       2    1  21.000000      0      0      1         0.0

In [157]:
#applying train test split to measure the accuracy
xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [158]:
#cross validation scores using all colums got after EDA
rf_cv_score=cross_val_score(estimator=modelKnn,X=xtrain,y=xtest,cv=5)
rf_cv_score.mean()

0.77047741935483871

In [159]:
#applying train test split to measure the accuracy
#we are removing SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [160]:
#cross validation scores after removing sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelKnn,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [161]:
#applying train test split to measure the accuracy
#we are removing ParCh column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [162]:
#cross validation scores After removing Parch colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelKnn,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [163]:
#applying train test split to measure the accuracy
#we are removing ParCh and SibSp column from EDA
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [164]:
#cross validation scores after removing parch and sibsp colums got after EDA
#rf_cv_score=cross_val_score(estimator=modelKnn,X=xtrain,y=xtest,cv=5)
#rf_cv_score.mean()

In [165]:
#the final one
#applying train test split to measure the accuracy
#xtrain,ytrain,xtest,ytest=train_test_split(titanicTrain.iloc[:,[1,2,3,4,5,6,7]],titanicTrain['Survived'],test_size=0.3,random_state=123)

In [166]:
#first one is giving better accuracy hence, we will be going for this one but need to tune parameters
m=1
for i in range(0,10):
    modelKnn=neighbors.KNeighborsClassifier(n_neighbors=m)
    knn_cv_score=cross_val_score(estimator=modelKnn,X=xtrain,y=xtest,cv=5)
    print knn_cv_score.mean()
    m=m+1

0.749625806452
0.744825806452
0.778516129032
0.756012903226
0.770477419355
0.765625806452
0.7704
0.7512
0.747948387097
0.736761290323

In [167]:
#when n=16 it gives best results
#lets create the model with n=3
#fit the model
modelKnn=neighbors.KNeighborsClassifier(n_neighbors=3)
modelKnn.fit(titanicTrain.iloc[:,[1,2,3,6]],titanicTrain['Survived'])

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=3, p=2,
           weights='uniform')

In [168]:
#lets predict
knnOutput=modelKnn.predict(titanicTest.iloc[:,[0,1,2,5]])

In [169]:
#lets try with nural net
from sklearn.neural_network import MLPClassifier

In [170]:
modelAnn = MLPClassifier()

In [171]:
#fitdata into model
modelAnn.fit(titanicTrain.iloc[:,[1,2,3,4,6]],titanicTrain['Survived'])

MLPClassifier(activation='relu', alpha=0.0001, batch_size='auto', beta_1=0.9,
       beta_2=0.999, early_stopping=False, epsilon=1e-08,
       hidden_layer_sizes=(100,), learning_rate='constant',
       learning_rate_init=0.001, max_iter=200, momentum=0.9,
       nesterovs_momentum=True, power_t=0.5, random_state=None,
       shuffle=True, solver='adam', tol=0.0001, validation_fraction=0.1,
       verbose=False, warm_start=False)

In [177]:
annOutput=modelAnn.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [178]:
#importing libraris for stacking ensemble
from brew.base import Ensemble, EnsembleClassifier
from brew.stacking.stacker import EnsembleStack, EnsembleStackClassifier
from brew.combination.combiner import Combiner

In [179]:
#creating models for stacking ensemble
clf1=RandomForestClassifier(max_depth=6,n_estimators=74)
clf2=svm.SVC(probability=True,kernel='rbf',C=5)
clf3=GradientBoostingClassifier(max_depth=4,min_samples_leaf=5)
#clf4 = MLPClassifier()
#clf5=linear_model.LogisticRegression(penalty='l1')
#clf6=neighbors.KNeighborsClassifier(n_neighbors=3)

In [180]:
#creating ensembles
ensemble = Ensemble([clf1, clf2, clf3])
eclf = EnsembleClassifier(ensemble=ensemble, combiner=Combiner('mean'))

In [181]:
import sklearn

In [182]:
#creating and adding layers to stack
layer_1 = Ensemble([clf1, clf2, clf3])
layer_2 = Ensemble([sklearn.clone(clf1)])
#layer_3 = Ensemble([sklearn.clone(clf1)])
#layer_4 = Ensemble([sklearn.clone(clf1,clf4)])
#layer_5 = Ensemble([sklearn.clone(clf1)])

stack = EnsembleStack(cv=3)

stack.add_layer(layer_1)
stack.add_layer(layer_2)
#stack.add_layer(layer_3)
#stack.add_layer(layer_4)
#stack.add_layer(layer_5)

sclf = EnsembleStackClassifier(stack)

In [183]:
clf_list = [clf1, clf2, clf3, eclf, sclf]
lbl_list = ['Random Forest', 'SVM', 'ANN', 'Ensemble', 'Stacking']

In [184]:
len(xtest)

623

In [185]:
#fitting the data
sclf.fit(np.array(titanicTrain.iloc[:,[1,2,3,4,6]]),np.array(titanicTrain['Survived']))

In [186]:
#output ofter stacked ensemble
stackedOutput=sclf.predict(titanicTest.iloc[:,[0,1,2,3,5]])

In [187]:
#lets do voting ensemble
z=[]
for i in range(0,418):
    p=(rfModelOutput[i]+svmModelOutput[i]+annOutput[i]+stackedOutput[i])+gradBoostOutput[i]
    #p=(rfModelOutput[i]+svmModelOutput[i]+logitFinalOutput[i])
    if(p>3):
        z.append(1)
    elif(p<2):
        z.append(0)
    elif(p==3 or p==2):
        z.append(stackedOutput[i])
    #if(rfModelOutput[i]==0 and svmModelOutput[i]==0 and logitFinalOutput[i]==0 and knnOutput[i]==0  and annOutput[i]==1):
        #z.append(1)
    #else:
        #z.append(rfModelOutput[i])

In [188]:
Counter(z)

Counter({0: 297, 1: 121})

In [189]:
#data preperation according to the format
Test=pd.read_csv("C:/Users/kallol/Desktop/Kaggle/Titanic/test.csv")

In [190]:
Test=Test.drop('Pclass',axis=1)
Test=Test.drop('Name',axis=1)
Test=Test.drop('Sex',axis=1)
Test=Test.drop('Age',axis=1)
Test=Test.drop('SibSp',axis=1)
Test=Test.drop('Parch',axis=1)
Test=Test.drop('Ticket',axis=1)
Test=Test.drop('Fare',axis=1)
Test=Test.drop('Cabin',axis=1)
Test=Test.drop('Embarked',axis=1)

In [191]:
Test['Survived']=z

In [192]:
#check for the submission file
Test.head()

   PassengerId  Survived
0          892       0.0
1          893       0.0
2          894       0.0
3          895       0.0
4          896       1.0

In [193]:
#Lets convert this to excel file
Test.to_csv('titanicOutput.csv')